{
  "484d9a333b4254618d5a2b3f9632b3b03541da5704717ca7e230384ac243d0d5": {
    "id": "4a81c2837e95c9e9",
    "name": "Communication Skills.pdf",
    "type": "PDF",
    "content": "[Page 1]\nCOMMUNICATION SKILLS\n\n[Page 2]\nWHAT IS COMMUNICATION?\n1. Communication istheprocess ofsharing ideas, feelings, orinformation between two\normore people .\n2. Itistheway people send andreceive messages tounderstand each other .\n3. Communication means exchanging thoughts orknowledge through speaking, writing,\norother signals .\n4. Itistheactoftransferring information from oneperson orplace toanother .\n5. Communication istheprocess ofconnecting with others toexpress needs, opinions,\noremotions .\n\n[Page 3]\nSKILL\nTheword Skill canbedefined as:\n1. SKILL means theability andcapability ofanindividual toperform thejobwell.\n2. SKILL means toperform thegiven task with fullexpertise bringing theproductive\nresults .\n3. Askill istheability todosomething well, usually gained through practice ortraining .\n4. Itistheknowledge andtalent needed toperform ataskeffectively .\n5. Askill issomething you candevelop and improve toperform work oractivities\nsuccessfully .\n\n[Page 4]\nWHAT IS COMMUNICATION SKILL?\n1. Communication skill istheability toshare ideas andinformation clearly soothers\ncanunderstand you.\n2. Itisthetalent ofexpressing thoughts and feelings effectively through speaking,\nwriting, orbody language .\n3. Communication skill means listening carefully andresponding inaway thatbuilds\nunderstanding .\n4. Itisthecapability toconnect with people byusing words, gestures, andexpressions\ninaproper manner .\n5. Communication skill istheartofexchanging messages inaway that isclear,\nrespectful, andmeaningful .\n\n[Page 5]\nIMPORTANCE OF COMMUNICATION SKILLS\n1. Builds Understanding :Good communication helps people understand each other\nclearly andavoid confusion .\n2. Strengthens Relationships :Itimproves personal and professional relationships by\ncreating trust andrespect .\n3. Boosts Confidence :Strong communication skills make iteasier toexpress ideas and\nopinions confidently .\n4. Helps inCareer Growth :Employers value good communicators because they can\nshare ideas, lead teams, andsolve problems effectively .\n5. Supports Learning :Clear communication makes iteasier togive and receive\ninstructions, feedback, andknowledge .\n\n[Page 6]\nCONTINUE\n6. Resolves Conflicts: Good communication helps solve disagreements peacefully by\nlistening and explaining calmly.\n7. Encourages Teamwork: It allows people to work together smoothly and achieve\ncommon goals.\n\n[Page 7]\nEXAMPLES\n➢Job Interview: Explaining your qualifications clearly to impress the interviewer.\n➢Classroom: Asking questions and sharing ideas with the teacher to understand\nlessons better.\n➢Workplace: Giving clear instructions to your team so a project is completed on time.\n➢Friendship: Talking openly to solve a misunderstanding with a friend.\n➢Public Speaking: Presenting a topic to an audience in a way that everyone can\nfollow.\n➢Customer Service: Politely answering a customer’s questions to keep them satisfied.\n➢Family Discussion: Expressing feelings respectfully during a family meeting to avoid\nconflict.\n\n[Page 8]\nLISTENING SKILL\nListening skill is the ability to carefully hear, understand, and respond to what someone is saying. It means focusing on the speaker’s words, feelings, and message instead of just waiting to reply. Good listening requires attention, patience, and an open mind. Barriers to Listening\n1. Distractions: Noise, phone notifications, or other people talking can break concentration.\n2. Lack of Focus: Daydreaming or thinking about something else while someone is speaking.\n3. Prejudice or Bias: Judging the speaker’s appearance, accent, or opinion before listening.\n4. Interrupting: Cutting the speaker off to give your own thoughts.\n5. Language Problems: Not understanding the words or vocabulary being used.\n6. Emotional Reactions: Getting angry or upset instead of calmly listening.\n\n[Page 9]\nWAYS TO REMOVE BARRIERS\nTo become a better listener, you can:\n1. Stay Focused: Give full attention to the speaker and avoid multitasking.\n2. Reduce Distractions: Turn off phones, lower background noise, and maintain eye\ncontact.\n3. Be Open -Minded: Listen without judging or forming an opinion too quickly.\n4. Wait Before Responding: Allow the speaker to finish before you reply.\n5. Ask Questions: If something is unclear, politely ask for clarification.\n6. Practice Active Listening: Nod, use facial expressions, or repeat key points to show\nunderstanding.\n\n[Page 10]\nACTIVE LISTENING\nActive listening is a way of listening where you give full attention to the speaker and\nshow that you truly understand their message. It is more than just hearing words —it\nmeans focusing on the speaker’s feelings, asking questions, and giving feedback to show\ninterest. Key Features of Active Listening:\n1. Full Attention: Looking at the speaker and avoiding distractions like phones or side\nconversations.\n2. Understanding: Trying to catch both the meaning and emotions behind the words.\n3. Feedback: Nodding, smiling, or saying small words like “I see” or “That makes\nsense” to show you are following.\n4. Clarification: Asking questions or repeating key points to make sure you understood\ncorrectly.\n5. Non-Judgment: Listening without interrupting or criticizing the speaker.\n\n[Page 11]\nActive Listening comprises of the following:\n➢Stop talking and start listening\n➢Focus attention on Speaker & avoid any distraction\n➢Maintain eye -contact\n➢Listen for central ideas\n➢Establish Rapport.\n➢Check your emotions to avoid any bias\n➢Concentrate on what the Speaker is saying. Focus your attention on key points,\nconcepts, and feelings displayed in the message.\n\n[Page 12]\n➢Suspend your judgements and avoid jumping to conclusion without first listening the\nspeaker fully.\n➢Listen for the main points, key ideas and important messages.\n➢Look for areas of interest, and agreement. If you have to disagree agreeably by\ncriticizing the ideas but not the speaker.\n➢Do not jump to the conclusion.\n➢Ask questions for clarification.\n➢Summarize what you understand, what is other person is saying.\n➢Take notes to remember what is said.\n\n[Page 13]\nPROCESS OF LISTENING\nListening is an active process through which we receive, understand, interpret, and\nrespond to spoken messages. It involves both hearing and understanding what is said. The process of listening can be divided into five main stages :\n1. Receiving (Hearing)\n➢This is the first stage , where the listener hears the sound of the speaker’s words.\n➢It involves paying attention and recognizing the sounds, tone, and pitch of the\nmessage. Example: You hear your teacher explaining a topic in class.\n\n[Page 14]\n2. Understanding (Comprehending)\n➢At this stage, the listener tries to understand the meaning of the words or message.\n➢It involves interpreting vocabulary, grammar, and context to make sense of what is heard. Example: You understand what your teacher means when she says, “The test will be on Friday.”\n3. Evaluating (Interpreting or Judging)\n➢Here, the listener analyzes and judges the message.\n➢You decide whether the message is true, logical, or important. Example: You think about whether the information your friend gave you is correct or not.\n\n[Page 15]\n4. Responding (Reacting)\n➢After understanding and evaluating, the listener gives feedback —either verbally or\nnonverbally.\n➢This can be a nod, smile, question, or spoken reply. Example: You nod in agreement or say, “Yes, I understand.”\n5. Remembering (Retaining)\n➢The final stage is storing the information in memory for future use.\n➢Good listeners remember important details from the conversation. Example: You recall your teacher’s instructions when preparing for the test.\n\n[Page 16]\nTYPES OF LISTENING\n1. Active Listening\nFocusing completely on the speaker, understanding the message, and responding\nthoughtfully. Example: A student paying attention to a teacher’s lecture, taking notes, and asking\nquestions.\n2. Passive Listening\nHearing the words but not giving full attention or feedback. Example: Listening to background music while doing homework.\n3. Critical Listening\nListening carefully to evaluate or judge what is being said. Example: Listening to a politician’s speech to decide whether to support their ideas.\n\n[Page 17]\nCONTINUE\n5. Appreciative Listening\nListening for enjoyment or pleasure. Example: Enjoying a favorite song, a poem recital, or a storytelling session.\n6. Selective Listening\nHearing only parts of the message that interest you and ignoring the rest. Example: A child listening only when their parent mentions “chocolate”\nduring a long talk.\n\n[Page 18]\nREADING SKILL\n1. Reading skill is the ability to recognize, understand, and interpret written words\nand sentences to get meaning from a text.\n2. Reading skill means the process of decoding written symbols to understand ideas,\ninformation, and emotions expressed by the writer.\n3. Reading skill is the process of getting meaning from written or printed text\nthrough understanding words, sentences, and ideas.\n4. Reading skill refers to the capacity to interpret and analyze written language\neffectively for learning and communication.\n\n[Page 19]\nTECHNIQUES OF READING/ TYPES\nReading techniques are methods or strategies that help readers understand, analyze, and remember what\nthey read. The main techniques of reading are:\n1. Skimming\nDefinition:\nSkimming means reading quickly to get the main idea or general overview of a text without focusing on\nevery word. Purpose:\nIt helps to understand the overall theme or central idea of a passage quickly. How to Do It:\n➢Read the title, headings, and subheadings .\n➢Look at the first and last sentences of paragraphs.\n➢Notice key words , dates, or names. Example:\nWhen you pick up a newspaper article, you may skim it to know what it’s about —for example, “The\narticle talks about climate change in Pakistan.”\n\n[Page 20]\n2. Scanning\nDefinition:\nScanning means reading quickly to find specific information or details such as\nnumbers, names, or dates. Purpose:\nIt helps to locate a particular piece of information without reading the entire text. How to Do It:\n➢Mov",
    "chunk_count": 70,
    "table_count": 0,
    "stats": {
      "word_count": 4416,
      "char_count": 30881,
      "line_count": 696,
      "page_count": 71,
      "table_count": 0,
      "image_count": 0,
      "chunk_count": 70,
      "languages": [
        "en"
      ],
      "reading_time_minutes": 22,
      "avg_words_per_page": 62.19718309859155
    },
    "metadata": {
      "filename": "Communication Skills.pdf",
      "file_path": "D:\\d drive\\final\\AI_Document_Intelligence\\data\\uploads\\Communication Skills.pdf",
      "file_size": 447230,
      "file_size_formatted": "436.7 KB",
      "file_extension": ".pdf",
      "format_name": "PDF",
      "created_at": "2025-12-18T02:21:19.120307",
      "language_info": {
        "language": "en",
        "language_name": "English",
        "confidence": 0.5,
        "is_rtl": false,
        "is_multilingual": false,
        "detected_languages": [
          [
            "en",
            0.5
          ]
        ]
      },
      "ocr_used": false,
      "has_tables": false,
      "has_images": false
    },
    "cached_at": "2025-12-18T02:21:19.120307"
  },
  "9b63dd1f33b7da7cb311e4d055e1e92d08f65f3c22c21f5ba32afbca9e8b74b1": {
    "id": "e9ebd0a883e5330c",
    "name": "Non-Verbal-Communication main.pptx",
    "type": "PPTX",
    "content": "[Slide 1]\n\nNon-Verbal Communication\n\nPresented By: Hammad Naeem\n\nRoll no : 24CYS40\n\n[Slide 2]\n\nIntroduction: What is Non-Verbal Communication? Nonverbal communication refers to the ways in which beings convey information about their emotions, needs, intentions, attitudes, and thoughts without the use of verbal language. NVC often reveals our true feelings and intentions more than words do. Agar koi kehta hai “Main theek hoon” lekin uska chehra udaas ho, awaaz dukhi ho, to uski body language asal jazbaat bata deti hai ke wo theek nahi ha\n\n. NVC is crucial across all cultures, encouraging positive interactions and understanding. Agar do log alag mulkon se milte hain aur ek doosre ki zubaan nahi samajhte, phir bhi muskurahat, aankhon ka contact, ya haath milana jaise gestures se unke darmiyan positive connection ban jata hai\n\n[Slide 3]\n\nDefining the Channels of Communication\n\nNon-verbal communication uses silent signals to interact with the world. Non-verbal communication mein hum bolte nahi, balkay muskurahat, aankhon ka contact, ya body language se apni feelings dikhate hain\n\nIntentional Signals\n\nConscious actions like waving goodbye or nodding in agreement. Jese kisi ko haath hila ke “bye” kehna ya sar hila ke “haan” kehna\n\nUnintentional Cues\n\nSubconscious signals, such as crossing arms when nervous or a tense facial expression when stressed. Subconscious signals wo hote hain jo hum bina soche samjhe dikhate hain, jaise nervous hone par arms cross karna aur stress mein tense chehra. Context is Key\n\nHow NVC is understood depends on the situation, like a hug being appropriate in one setting but not another. NVC ko samajhna situation par depend karta hai; jaise funeral mein muskurana inappropriate hoga, lekin birthday party ya celebration mein muskurana bilkul theek aur natural hai.\n\n[Slide 4]\n\nThe Power of Non-Verbal Cues\n\nNon-verbal communication shapes initial perceptions and improves relationships. Building Trust\n\nConsistent NVC establishes credibility and trust. Agar tum hamesha eye contact aur positive gestures use karte ho, log tum par bharosa karenge\n\nExpressing Confidence\n\nA firm handshake or open stance projects authority. Job interview mein seedha khade hona aur haath milana tumhari self-assurance dikhata hai\n\nEmotional Clarity\n\nNVC conveys subtle emotions beyond words. Muskurahat ya slightly tilted head friendliness aur interest dikhata hai\n\n[Slide 5]\n\nThe Seven Dimensions of Silent Communication\n\nNon-verbal cues are essential in shaping perceptions. Mastering these areas gives you greater control over how you are perceived. Facial Expressions\n\nShow emotions like happiness, sadness, or surprise. A smile conveys warmth, a frown indicates concern. Gestures\n\nHand and arm movements emphasize points. A thumbs-up means approval, pointing directs attention. Posture & Movement\n\nHow we stand and move reveals confidence or tension. Upright posture suggests assurance, slumped shoulders might show nervousness. Eye Contact\n\nShows attention and engagement. Direct eye contact conveys honesty, while avoiding it might signal discomfort. Appearance\n\nClothing, grooming, and style signal professionalism or personality. A sharp suit projects authority, casual attire suggests relaxation. Tone of Voice (Paralanguage)\n\nThe pitch, speed, and volume of speech convey meaning beyond words. A calm tone reassures, a quick pace might show excitement. Touch (Haptics)\n\nPhysical contact like a handshake or a pat on the back. A firm handshake indicates respect, a gentle touch offers comfort. Space (Proxemics)\n\nThe physical distance maintained between people. Close proximity suggests intimacy, while greater distance indicates formality.\n\n[Slide 6]\n\nFocus on the Face: Universal Facial Expressions\n\nFacial expressions are a globally understood way to instantly reveal our emotional state. Surprise\n\nWide eyes, raised brows, and an open mouth signal unexpected events. Joy\n\nA true smile engages both the eyes and mouth, clearly showing happiness. Anger\n\nFurrowed brows, tense lips, and a fixed stare convey strong displeasure.\n\n[Slide 7]\n\nThe Power of Posture and Body Movement\n\nBody language, or Kinesics, reveals our inner state through posture and movement, influencing how we are perceived. Open vs. Closed Posture\n\nOpen posture (uncrossed arms, visible hands) signals receptiveness. Closed posture (crossed arms) suggests defensiveness. The Confidence Indicator\n\nStanding tall with shoulders back projects confidence and authority. A steady stance indicates engagement. Fidgeting & Tension\n\nFidgeting (like tapping feet or playing with hair) often reveals nervousness, anxiety, or boredom.\n\n[Slide 8]\n\nConnecting Through Eye Contact and Tone\n\nEye Contact (Oculesics)\n\nMaintain steady, engaged eye contact to show attentiveness, honesty, and respect. A lack of eye contact can signal disinterest. Tone of Voice (Paralanguage)\n\nYour tone—not just words—conveys emotion and intent. A soft, steady tone shows composure, while varied pitch and volume keep listeners engaged.\n\n[Slide 9]\n\nNon-Verbal Communication in Professional Contexts\n\nIn the workplace, effective non-verbal signals can determine career success. They are especially critical during job interviews, presentations, and team meetings. Project confidence and engagement through upright posture and attentive body language. Engage your audience and project credibility with a confident smile and deliberate gestures. Show active listening and value for colleagues' input through nodding and positive facial expressions. A study found that non-verbal cues account for 55% of the message impact in face-to-face communication.\n\n[Slide 10]\n\nMastering Non-Verbal Communication: Your Lasting Impact\n\nActions Speak Louder Than Words\n\nNon-verbal communication is not just a supplement; it's the foundation of profound influence. By consciously honing your body language, vocal tone, and facial expressions, you unlock unparalleled credibility and connection, creating memorable impressions. Cultivate Awareness\n\nRecognize your own non-verbal habits and accurately interpret others' cues. Achieve Alignment\n\nEnsure perfect harmony between your words and non-verbal cues for authentic and powerful messaging. Maximize Impact\n\nLeverage non-verbal signals strategically to forge positive, lasting impressions in every interaction.\n\n[Slide 11]\n\n[Slide 12]",
    "chunk_count": 10,
    "table_count": 0,
    "stats": {
      "word_count": 906,
      "char_count": 6345,
      "line_count": 125,
      "page_count": 12,
      "table_count": 0,
      "image_count": 0,
      "chunk_count": 10,
      "languages": [
        "en"
      ],
      "reading_time_minutes": 4,
      "avg_words_per_page": 75.5
    },
    "metadata": {
      "filename": "Non-Verbal-Communication main.pptx",
      "file_path": "D:\\d drive\\final\\AI_Document_Intelligence\\data\\uploads\\Non-Verbal-Communication main.pptx",
      "file_size": 19435079,
      "file_size_formatted": "18.5 MB",
      "file_extension": ".pptx",
      "format_name": "PowerPoint",
      "created_at": "2025-12-18T02:21:45.145820",
      "language_info": {
        "language": "en",
        "language_name": "English",
        "confidence": 0.5,
        "is_rtl": false,
        "is_multilingual": false,
        "detected_languages": [
          [
            "en",
            0.5
          ]
        ]
      },
      "ocr_used": false,
      "has_tables": false,
      "has_images": false
    },
    "cached_at": "2025-12-18T02:21:45.145820"
  },
  "81fde9020c8722dc1e40f72da3d29935eb9cd25eb88632d46c75d196e0d3b9dc": {
    "id": "645ec183faef67bf",
    "name": "Non-Verbal-Communication main.pptx",
    "type": "PPTX",
    "content": "[Slide 1]\n\nNon-Verbal Communication\n\nPresented By: Hammad Naeem\n\nRoll no : 24CYS40\n\n[Slide 2]\n\nIntroduction: What is Non-Verbal Communication? Nonverbal communication refers to the ways in which beings convey information about their emotions, needs, intentions, attitudes, and thoughts without the use of verbal language. NVC often reveals our true feelings and intentions more than words do. Agar koi kehta hai “Main theek hoon” lekin uska chehra udaas ho, awaaz dukhi ho, to uski body language asal jazbaat bata deti hai ke wo theek nahi ha\n\n. NVC is crucial across all cultures, encouraging positive interactions and understanding. Agar do log alag mulkon se milte hain aur ek doosre ki zubaan nahi samajhte, phir bhi muskurahat, aankhon ka contact, ya haath milana jaise gestures se unke darmiyan positive connection ban jata hai\n\n[Slide 3]\n\nDefining the Channels of Communication\n\nNon-verbal communication uses silent signals to interact with the world. Non-verbal communication mein hum bolte nahi, balkay muskurahat, aankhon ka contact, ya body language se apni feelings dikhate hain\n\nIntentional Signals\n\nConscious actions like waving goodbye or nodding in agreement. Jese kisi ko haath hila ke “bye” kehna ya sar hila ke “haan” kehna\n\nUnintentional Cues\n\nSubconscious signals, such as crossing arms when nervous or a tense facial expression when stressed. Subconscious signals wo hote hain jo hum bina soche samjhe dikhate hain, jaise nervous hone par arms cross karna aur stress mein tense chehra. Context is Key\n\nHow NVC is understood depends on the situation, like a hug being appropriate in one setting but not another. NVC ko samajhna situation par depend karta hai; jaise funeral mein muskurana inappropriate hoga, lekin birthday party ya celebration mein muskurana bilkul theek aur natural hai.\n\n[Slide 4]\n\nThe Power of Non-Verbal Cues\n\nNon-verbal communication shapes initial perceptions and improves relationships. Building Trust\n\nConsistent NVC establishes credibility and trust. Agar tum hamesha eye contact aur positive gestures use karte ho, log tum par bharosa karenge\n\nExpressing Confidence\n\nA firm handshake or open stance projects authority. Job interview mein seedha khade hona aur haath milana tumhari self-assurance dikhata hai\n\nEmotional Clarity\n\nNVC conveys subtle emotions beyond words. Muskurahat ya slightly tilted head friendliness aur interest dikhata hai\n\n[Slide 5]\n\nThe Seven Dimensions of Silent Communication\n\nNon-verbal cues are essential in shaping perceptions. Mastering these areas gives you greater control over how you are perceived. Facial Expressions\n\nShow emotions like happiness, sadness, or surprise. A smile conveys warmth, a frown indicates concern. Gestures\n\nHand and arm movements emphasize points. A thumbs-up means approval, pointing directs attention. Posture & Movement\n\nHow we stand and move reveals confidence or tension. Upright posture suggests assurance, slumped shoulders might show nervousness. Eye Contact\n\nShows attention and engagement. Direct eye contact conveys honesty, while avoiding it might signal discomfort. Appearance\n\nClothing, grooming, and style signal professionalism or personality. A sharp suit projects authority, casual attire suggests relaxation. Tone of Voice (Paralanguage)\n\nThe pitch, speed, and volume of speech convey meaning beyond words. A calm tone reassures, a quick pace might show excitement. Touch (Haptics)\n\nPhysical contact like a handshake or a pat on the back. A firm handshake indicates respect, a gentle touch offers comfort. Space (Proxemics)\n\nThe physical distance maintained between people. Close proximity suggests intimacy, while greater distance indicates formality.\n\n[Slide 6]\n\nFocus on the Face: Universal Facial Expressions\n\nFacial expressions are a globally understood way to instantly reveal our emotional state. Surprise\n\nWide eyes, raised brows, and an open mouth signal unexpected events. Joy\n\nA true smile engages both the eyes and mouth, clearly showing happiness. Anger\n\nFurrowed brows, tense lips, and a fixed stare convey strong displeasure.\n\n[Slide 7]\n\nThe Power of Posture and Body Movement\n\nBody language, or Kinesics, reveals our inner state through posture and movement, influencing how we are perceived. Open vs. Closed Posture\n\nOpen posture (uncrossed arms, visible hands) signals receptiveness. Closed posture (crossed arms) suggests defensiveness. The Confidence Indicator\n\nStanding tall with shoulders back projects confidence and authority. A steady stance indicates engagement. Fidgeting & Tension\n\nFidgeting (like tapping feet or playing with hair) often reveals nervousness, anxiety, or boredom.\n\n[Slide 8]\n\nConnecting Through Eye Contact and Tone\n\nEye Contact (Oculesics)\n\nMaintain steady, engaged eye contact to show attentiveness, honesty, and respect. A lack of eye contact can signal disinterest. Tone of Voice (Paralanguage)\n\nYour tone—not just words—conveys emotion and intent. A soft, steady tone shows composure, while varied pitch and volume keep listeners engaged.\n\n[Slide 9]\n\nNon-Verbal Communication in Professional Contexts\n\nIn the workplace, effective non-verbal signals can determine career success. They are especially critical during job interviews, presentations, and team meetings. Project confidence and engagement through upright posture and attentive body language. Engage your audience and project credibility with a confident smile and deliberate gestures. Show active listening and value for colleagues' input through nodding and positive facial expressions. A study found that non-verbal cues account for 55% of the message impact in face-to-face communication.\n\n[Slide 10]\n\nMastering Non-Verbal Communication: Your Lasting Impact\n\nActions Speak Louder Than Words\n\nNon-verbal communication is not just a supplement; it's the foundation of profound influence. By consciously honing your body language, vocal tone, and facial expressions, you unlock unparalleled credibility and connection, creating memorable impressions. Cultivate Awareness\n\nRecognize your own non-verbal habits and accurately interpret others' cues. Achieve Alignment\n\nEnsure perfect harmony between your words and non-verbal cues for authentic and powerful messaging. Maximize Impact\n\nLeverage non-verbal signals strategically to forge positive, lasting impressions in every interaction.\n\n[Slide 11]\n\n[Slide 12]",
    "chunk_count": 10,
    "table_count": 0,
    "stats": {
      "word_count": 906,
      "char_count": 6345,
      "line_count": 125,
      "page_count": 12,
      "table_count": 0,
      "image_count": 0,
      "chunk_count": 10,
      "languages": [
        "en"
      ],
      "reading_time_minutes": 4,
      "avg_words_per_page": 75.5
    },
    "metadata": {
      "filename": "Non-Verbal-Communication main.pptx",
      "file_path": "D:\\d drive\\final\\AI_Document_Intelligence\\data\\uploads\\Non-Verbal-Communication main.pptx",
      "file_size": 19435079,
      "file_size_formatted": "18.5 MB",
      "file_extension": ".pptx",
      "format_name": "PowerPoint",
      "created_at": "2025-12-18T02:23:37.817284",
      "language_info": {
        "language": "en",
        "language_name": "English",
        "confidence": 0.5,
        "is_rtl": false,
        "is_multilingual": false,
        "detected_languages": [
          [
            "en",
            0.5
          ]
        ]
      },
      "ocr_used": false,
      "has_tables": false,
      "has_images": false
    },
    "cached_at": "2025-12-18T02:23:37.817284"
  },
  "59075860c5f623e2317acbac72100acb5c9fc3901d529e3da2de0d6a98917c6b": {
    "id": "a77f053a8a386d1d",
    "name": "AI.pdf",
    "type": "PDF",
    "content": "",
    "chunk_count": 0,
    "table_count": 0,
    "stats": {
      "word_count": 0,
      "char_count": 0,
      "line_count": 1,
      "page_count": 28,
      "table_count": 0,
      "image_count": 0,
      "chunk_count": 0,
      "languages": [
        "en"
      ],
      "reading_time_minutes": 1,
      "avg_words_per_page": 0.0
    },
    "metadata": {
      "filename": "AI.pdf",
      "file_path": "D:\\d drive\\final\\AI_Document_Intelligence\\data\\uploads\\AI.pdf",
      "file_size": 1920035,
      "file_size_formatted": "1.8 MB",
      "file_extension": ".pdf",
      "format_name": "PDF",
      "created_at": "2025-12-18T02:32:32.277524",
      "language_info": {
        "language": "en",
        "language_name": "English",
        "confidence": 0.0,
        "is_rtl": false,
        "is_multilingual": false,
        "detected_languages": []
      },
      "ocr_used": false,
      "has_tables": false,
      "has_images": false
    },
    "cached_at": "2025-12-18T02:32:32.277524"
  }
}